# 3. Осуществить программу работы с органическими клетками, состоящими из ячеек. Необходимо создать класс «Клетка».
# В его конструкторе инициализировать параметр, соответствующий количеству ячеек клетки (целое число).
# В классе должны быть реализованы методы перегрузки арифметических операторов: сложение (__add__()),
# вычитание (__sub__()), умножение (__mul__()), деление (__floordiv____truediv__()).
#
# Эти методы должны применяться только к клеткам и выполнять увеличение, уменьшение,
# умножение и округление до целого числа деления клеток, соответственно.
#
# Сложение. Объединение двух клеток. При этом число ячеек общей клетки должно равняться сумме ячеек исходных двух клеток.
# Вычитание. Участвуют две клетки. Операцию необходимо выполнять, только если разность количества
# ячеек двух клеток больше нуля, иначе выводить соответствующее сообщение.
# Умножение. Создаётся общая клетка из двух. Число ячеек общей клетки — произведение количества ячеек этих двух клеток.
# Деление. Создаётся общая клетка из двух. Число ячеек общей клетки определяется как целочисленное
# деление количества ячеек этих двух клеток.
#
# В классе необходимо реализовать метод make_order(), принимающий экземпляр класса и количество ячеек в ряду.
# Этот метод позволяет организовать ячейки по рядам.
# Метод должен возвращать строку вида *****\n*****\n*****..., где количество ячеек между \n равно переданному аргументу.
# Если ячеек на формирование ряда не хватает, то в последний ряд записываются все оставшиеся.
# Например, количество ячеек клетки равняется 12, а количество ячеек в ряду — 5.
# В этом случае метод make_order() вернёт строку: *****\n*****\n**.
# Или, количество ячеек клетки — 15, а количество ячеек в ряду равняется 5.
# Тогда метод make_order() вернёт строку: *****\n*****\n*****.

class Cell:
    def __init__(self, number_of_cells):
        self.cells = number_of_cells

    def __add__(self, other):
        if isinstance(other, Cell):
            return Cell(self.cells + other.cells)
        print("Слогаемые не клетки")

    def __sub__(self, other):
        if isinstance(other, Cell):
            temp = self.cells - other.cells
            if temp >= 0:
                return Cell(temp)
            else:
                print("Вторая клетка больше первой")
                return
        print("Слогаемые не клетки")

    def __mul__(self, other):
        if isinstance(other, Cell):
            return Cell(self.cells * other.cells)
        print("Слогаемые не клетки")

    def __floordiv__(self, other):
        if isinstance(other, Cell):
            return Cell(self.cells // other.cells)
        print("Слогаемые не клетки")

    def __truediv__(self, other):
        if isinstance(other, Cell):
            return Cell(self.cells // other.cells)
        print("Слогаемые не клетки")

    def __str__(self):
        return str(self.cells)

    @classmethod
    def make_order(cls, cell, n):
        col = cell.cells // n
        residue = cell.cells % n
        return ("*"*n + "\n")*col + "*"*residue


cell_1 = Cell(143)
cell_2 = Cell(12)

print(cell_1 // cell_2)

print(Cell.make_order(cell_1, 20))
